tutorials/turbine/NREL5MWRef.uniformFlow/system/turbineArrayProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

globalProperties
{
    outputControl       "timeStep";
    outputInterval       1;
    perturb              1.0E-5;
}

turbine0
{
    turbineType         "NREL5MWRef";
    baseLocation        (5.0191 0.0 -90.0);
    numBladePoints      64;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              10;
    tipRootLossCorrType "none";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed            9.15519863;
    Pitch                0.0;
    TorqueGen            0.0;
    NacYaw              270.0;
    fluidDensity        1.00;
}
